leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_regdef.h
/** \brief  EVR ADC Status Register */
typedef struct _Ifx_SCU_EVRADCSTAT_Bits
{
    unsigned int ADC13V:8;                  /**< \brief [7:0] ADC 1.3 V Conversion Result (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int ADCSWDV:8;                 /**< \brief [23:16] ADC External Supply Conversion Result (rh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int VAL:1;                     /**< \brief [31:31] Valid Status (rh) */
} Ifx_SCU_EVRADCSTAT_Bits;

/** \brief  EVR Monitor Control Register */
typedef struct _Ifx_SCU_EVRMONCTRL_Bits
{
    unsigned int EVR13OVMOD:2;              /**< \brief [1:0] 1.3 V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int EVR13UVMOD:2;              /**< \brief [5:4] 1.3 V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int SWDOVMOD:2;                /**< \brief [17:16] Supply monitor (SWD) Over-voltage monitoring mode (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int SWDUVMOD:2;                /**< \brief [21:20] Supply monitor (SWD) Under-voltage monitoring mode (rw) */
    unsigned int reserved_22:8;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SCU_EVRMONCTRL_Bits;

/** \brief  EVR Over-voltage Configuration Register */
typedef struct _Ifx_SCU_EVROVMON_Bits
{
    unsigned int EVR13OVVAL:8;              /**< \brief [7:0] 1.3 V Regulator Over-voltage threshold (rw) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int SWDOVVAL:8;                /**< \brief [23:16] Supply monitor (SWD) Over-voltage threshold value (rw) */
    unsigned int reserved_24:6;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVROVMON_Bits;

/** \brief  EVR Reset Control Register */
typedef struct _Ifx_SCU_EVRRSTCON_Bits
{
    unsigned int reserved_0:28;             /**< \brief \internal Reserved */
    unsigned int RSTSWDOFF:1;               /**< \brief [28:28] EVR SWD Reset Enable (rw) */
    unsigned int BPRSTSWDOFF:1;             /**< \brief [29:29] Bit Protection RSTSWDOFF (w) */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRRSTCON_Bits;

/** \brief  EVR13 SD Coefficient Register 2 */
typedef struct _Ifx_SCU_EVRSDCOEFF2_Bits
{
    unsigned int SD33P:4;                   /**< \brief [3:0] P Coefficient (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int SD33I:4;                   /**< \brief [11:8] I Coefficient (rw) */
    unsigned int reserved_12:19;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCOEFF2_Bits;

/** \brief  EVR13 SD Control Register 1 */
typedef struct _Ifx_SCU_EVRSDCTRL1_Bits
{
    unsigned int SDFREQSPRD:4;              /**< \brief [3:0] Frequency Spread Mode (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int TON:8;                     /**< \brief [15:8] Charge Phase length (rw) */
    unsigned int TOFF:8;                    /**< \brief [23:16] Discharge Phase length (rw) */
    unsigned int SDSTEP:4;                  /**< \brief [27:24] Droop Voltage Step (rw) */
    unsigned int SYNCDIV:3;                 /**< \brief [30:28] Clock Divider Ratio for external DCDC SYNC signal (rw) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL1_Bits;

/** \brief  EVR13 SD Control Register 2 */
typedef struct _Ifx_SCU_EVRSDCTRL2_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int STBS:2;                    /**< \brief [9:8] Stabilization strength (rw) */
    unsigned int STSP:2;                    /**< \brief [11:10] Startup Speed (rw) */
    unsigned int NS:2;                      /**< \brief [13:12] Noise shaper setting (rw) */
    unsigned int OL:1;                      /**< \brief [14:14] Open Loop activation (rw) */
    unsigned int PIAD:1;                    /**< \brief [15:15] PI coefficient adaptation (rw) */
    unsigned int ADCMODE:4;                 /**< \brief [19:16] Operating Mode for ADC (rw) */
    unsigned int ADCLPF:2;                  /**< \brief [21:20] Time constant of digital LPF of tracking ADC (rw) */
    unsigned int ADCLSB:1;                  /**< \brief [22:22] PID LSB size (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int SDLUT:6;                   /**< \brief [29:24] Non-linear Starting Point (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL2_Bits;

/** \brief  EVR13 SD Control Register 3 */
typedef struct _Ifx_SCU_EVRSDCTRL3_Bits
{
    unsigned int SDOLCON:7;                 /**< \brief [6:0] Initial Conductance (rw) */
    unsigned int MODSEL:1;                  /**< \brief [7:7] Operation Mode Selection (rw) */
    unsigned int MODLOW:7;                  /**< \brief [14:8] Low threshold for Mode change (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int SDVOKLVL:6;                /**< \brief [21:16] Configuration of Voltage OK Signal (rw) */
    unsigned int MODMAN:2;                  /**< \brief [23:22] Manual Mode Selection (rw) */
    unsigned int MODHIGH:7;                 /**< \brief [30:24] High threshold for Mode change (rw) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL3_Bits;

/** \brief  EVR Status Register */
typedef struct _Ifx_SCU_EVRSTAT_Bits
{
    unsigned int EVR13:1;                   /**< \brief [0:0] EVR13 status (rh) */
    unsigned int OV13:1;                    /**< \brief [1:1] EVR13 Regulator Over-voltage event flag (rh) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int OVSWD:1;                   /**< \brief [4:4] Supply Watchdog (SWD) Over-voltage event flag (rh) */
    unsigned int UV13:1;                    /**< \brief [5:5] EVR13 Regulator Under-voltage event flag (rh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int UVSWD:1;                   /**< \brief [7:7] Supply Watchdog (SWD) Under-voltage event flag (rh) */
    unsigned int reserved_8:2;              /**< \brief \internal Reserved */
    unsigned int BGPROK:1;                  /**< \brief [10:10] Primary Bandgap status (rh) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int SCMOD:2;                   /**< \brief [13:12] Switch Capacitor SMPS Mode (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_SCU_EVRSTAT_Bits;

/** \brief  EVR Under-voltage Configuration Register */
typedef struct _Ifx_SCU_EVRUVMON_Bits
{
    unsigned int EVR13UVVAL:8;              /**< \brief [7:0] 1.3 V Regulator Under-voltage threshold (rw) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int SWDUVVAL:8;                /**< \brief [23:16] Supply monitor (SWD) Under-voltage threshold value (rw) */
    unsigned int reserved_24:6;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRUVMON_Bits;

