leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ACCEN1_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_ACCEN1;

/** \brief  Application Reset Disable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ARSTDIS_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_ARSTDIS;

/** \brief  CCU Clock Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON0;

/** \brief  CCU Clock Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON1;

/** \brief  CCU Clock Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON2;

/** \brief  CCU Clock Control Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON3_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON3;

/** \brief  CCU Clock Control Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON4_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON4;

/** \brief  CCU Clock Control Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON5_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON5;

/** \brief  CCU Clock Control Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CCUCON6_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_CCUCON6;

/** \brief  Chip Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_CHIPID_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_CHIPID;

/** \brief  Die Temperature Sensor Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_DTSCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_DTSCON;

/** \brief  Die Temperature Sensor Limit Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_DTSLIM_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_DTSLIM;

/** \brief  Die Temperature Sensor Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_DTSSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_DTSSTAT;

/** \brief  External Input Channel Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EICR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_EICR;

/** \brief  External Input Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EIFR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_EIFR;

/** \brief  Emergency Stop Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EMSR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_EMSR;

/** \brief  ESR Input Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ESRCFG_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_ESRCFG;

/** \brief  ESR Output Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ESROCFG_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_ESROCFG;

/** \brief  EVR13 Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVR13CON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVR13CON;

/** \brief  EVR ADC Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRADCSTAT_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRADCSTAT;

/** \brief  EVR Monitor Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRMONCTRL_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRMONCTRL;

/** \brief  EVR Over-voltage Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVROVMON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVROVMON;

