leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_regdef.h
/** \brief  EVR Reset Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRRSTCON_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_EVRRSTCON;

/** \brief  EVR13 SD Coefficient Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCOEFF2_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCOEFF2;

/** \brief  EVR13 SD Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL1_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL1;

/** \brief  EVR13 SD Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL2_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL2;

/** \brief  EVR13 SD Control Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSDCTRL3_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_EVRSDCTRL3;

/** \brief  EVR Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_EVRSTAT;

/** \brief  EVR Under-voltage Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EVRUVMON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_EVRUVMON;

/** \brief  External Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_EXTCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_EXTCON;

/** \brief  Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_FDR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_FDR;

/** \brief  Flag Modification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_FMR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_FMR;

/** \brief  Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_SCU_ID;

/** \brief  Flag Gating Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_IGCR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_IGCR;

/** \brief  ESR Input Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_IN_Bits B;                      /**< \brief Bitfield access */
} Ifx_SCU_IN;

/** \brief  Input/Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_IOCR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_IOCR;

/** \brief  Logic BIST Control 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LBISTCTRL0_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_LBISTCTRL0;

/** \brief  Logic BIST Control 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LBISTCTRL1_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_LBISTCTRL1;

/** \brief  Logic BIST Control 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LBISTCTRL2_Bits B;              /**< \brief Bitfield access */
} Ifx_SCU_LBISTCTRL2;

/** \brief  LCL CPU0 Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LCLCON0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_LCLCON0;

/** \brief  LCL Test Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_LCLTEST_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_LCLTEST;

/** \brief  Manufacturer Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_MANID_Bits B;                   /**< \brief Bitfield access */
} Ifx_SCU_MANID;

/** \brief  ESR Output Modification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OMR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_OMR;

