leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_regdef.h
/** \brief  OSC Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OSCCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_OSCCON;

/** \brief  ESR Output Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OUT_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_OUT;

/** \brief  Overlay Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OVCCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_OVCCON;

/** \brief  Overlay Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_OVCENABLE_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_OVCENABLE;

/** \brief  Pad Disable Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PDISC_Bits B;                   /**< \brief Bitfield access */
} Ifx_SCU_PDISC;

/** \brief  ESR Pad Driver Mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PDR_Bits B;                     /**< \brief Bitfield access */
} Ifx_SCU_PDR;

/** \brief  Pattern Detection Result Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PDRR_Bits B;                    /**< \brief Bitfield access */
} Ifx_SCU_PDRR;

/** \brief  PLL Configuration 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLCON0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLCON0;

/** \brief  PLL Configuration 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLCON1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLCON1;

/** \brief  PLL Configuration 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLCON2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLCON2;

/** \brief  PLL_ERAY Configuration 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLERAYCON0_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PLLERAYCON0;

/** \brief  PLL_ERAY Configuration 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLERAYCON1_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PLLERAYCON1;

/** \brief  PLL_ERAY Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLERAYSTAT_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PLLERAYSTAT;

/** \brief  PLL Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PLLSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PLLSTAT;

/** \brief  Power Management Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMCSR_Bits B;                   /**< \brief Bitfield access */
} Ifx_SCU_PMCSR;

/** \brief  Standby and Wake-up Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWCR0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PMSWCR0;

/** \brief  Standby and Wake-up Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWCR1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PMSWCR1;

/** \brief  Standby and Wake-up Control Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWCR3_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_PMSWCR3;

/** \brief  Standby and Wake-up Status Flag Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWSTAT_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_PMSWSTAT;

/** \brief  Standby and Wake-up Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWSTATCLR_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_PMSWSTATCLR;

/** \brief  Standby WUT Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_PMSWUTCNT_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_PMSWUTCNT;

