leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxScu_regdef.h
/** \brief  Reset Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_RSTCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_RSTCON;

/** \brief  Additional Reset Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_RSTCON2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_RSTCON2;

/** \brief  Reset Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_RSTSTAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_RSTSTAT;

/** \brief  Safety Heartbeat Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_SAFECON_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_SAFECON;

/** \brief  Start-up Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_STSTAT_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_STSTAT;

/** \brief  Software Reset Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_SWRSTCON_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_SWRSTCON;

/** \brief  System Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_SYSCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_SCU_SYSCON;

/** \brief  Trap Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPCLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_TRAPCLR;

/** \brief  Trap Disable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPDIS_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_TRAPDIS;

/** \brief  Trap Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPSET_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_TRAPSET;

/** \brief  Trap Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_TRAPSTAT_Bits B;                /**< \brief Bitfield access */
} Ifx_SCU_TRAPSTAT;

/** \brief  CPU WDT Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTCPU_CON0_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_WDTCPU_CON0;

/** \brief  CPU WDT Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTCPU_CON1_Bits B;             /**< \brief Bitfield access */
} Ifx_SCU_WDTCPU_CON1;

/** \brief  CPU WDT Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTCPU_SR_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_WDTCPU_SR;

/** \brief  Safety WDT Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTS_CON0_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_WDTS_CON0;

/** \brief  Safety WDT Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTS_CON1_Bits B;               /**< \brief Bitfield access */
} Ifx_SCU_WDTS_CON1;

/** \brief  Safety WDT Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SCU_WDTS_SR_Bits B;                 /**< \brief Bitfield access */
} Ifx_SCU_WDTS_SR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  CPU watchdog */
typedef volatile struct _Ifx_SCU_WDTCPU
{
    Ifx_SCU_WDTCPU_CON0 CON0;               /**< \brief 0, CPU WDT Control Register 0 */
    Ifx_SCU_WDTCPU_CON1 CON1;               /**< \brief 4, CPU WDT Control Register 1 */
    Ifx_SCU_WDTCPU_SR SR;                   /**< \brief 8, CPU WDT Status Register */
} Ifx_SCU_WDTCPU;

/** \brief  Safety watchdog */
typedef volatile struct _Ifx_SCU_WDTS
{
    Ifx_SCU_WDTS_CON0 CON0;                 /**< \brief 0, Safety WDT Control Register 0 */
    Ifx_SCU_WDTS_CON1 CON1;                 /**< \brief 4, Safety WDT Control Register 1 */
    Ifx_SCU_WDTS_SR SR;                     /**< \brief 8, Safety WDT Status Register */
} Ifx_SCU_WDTS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

